<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.yisu.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.yisu.cn）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Home\Model;

use Think\Model;

/**
 * 公告模型
 * @author 王强
 */
class AnnouncementModel extends Model
{
    
    /**
     * 获取公告
     */
    public function getAnnouncement ()
    {
        
        $announcements = S('ANNOUNCEMENT_BY_ME');
        
        if (empty($announcements)) {
            // 亿速公告
            $announcements = M("Announcement")->field("id,title,type")
            ->order("create_time desc")
            ->limit(5)
            ->select();
        } else {
            return $announcements;
        }
        
        if (empty($announcements)) {
            return [];
        }
        
        S('ANNOUNCEMENT_BY_ME', $announcements, 19);
        
        return $announcements;
    }
}